{
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "view-in-github",
        "colab_type": "text"
      },
      "source": [
        "<a href=\"https://colab.research.google.com/github/ruchirlives/Python/blob/main/Neomodel_Base.ipynb\" target=\"_parent\"><img src=\"https://colab.research.google.com/assets/colab-badge.svg\" alt=\"Open In Colab\"/></a>"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "n8SP0Y54Xg_o"
      },
      "source": [
        "# Initialisation"
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Load modules"
      ],
      "metadata": {
        "id": "zyXEZJ8N7GGa"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# # Set variables\n",
        "# Please ensure this work book is called with DATABASE_URL as parameter\n",
        "\n",
        "try:\n",
        "    DATABASE_URL\n",
        "except KeyError:\n",
        "    print(\"DATABASE_URL not set\")\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "084Bn2nmrXfm",
        "outputId": "04b90f29-c0fb-4208-d33d-8794ffc7cbab"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "DATABASE_URL not set. Setting to default.\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "ntfNJPa5a4A2"
      },
      "outputs": [],
      "source": [
        "%pip install --quiet neo4j\n",
        "%pip install --quiet neomodel"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "DHAVdktzbAp-"
      },
      "outputs": [],
      "source": [
        "import os\n",
        "from google.colab import userdata\n",
        "\n",
        "# @title Get Neo4j Database\n",
        "from neo4j import GraphDatabase\n",
        "\n",
        "# uri = userdata.get('NEO4J_URI')  # or \"neo4j://localhost:7687\" if you're using Neo4j 4.x and above\n",
        "url = DATABASE_URL\n",
        "uri = \"bolt://\" + url\n",
        "user = userdata.get('NEO4J_USERNAME')\n",
        "psw = userdata.get('NEO4J_LOCALPWD')\n",
        "\n",
        "driver = GraphDatabase.driver(uri, auth=(user, psw))\n"
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Neomodel initialise"
      ],
      "metadata": {
        "id": "3LtofFMzzxiv"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "from neomodel import config, db, DateProperty, StructuredNode, StringProperty, RelationshipFrom, RelationshipTo, StructuredRel, ZeroOrMore, OneOrMore, ArrayProperty, IntegerProperty, FloatProperty\n",
        "import pandas as pd\n",
        "\n",
        "config.DATABASE_URL = 'bolt://{}:{}@{}'.format(user, psw, url) # Corrected URI format\n",
        "print(config.DATABASE_URL)\n",
        "db.set_connection(driver=driver)\n",
        "results, meta = db.cypher_query(\"MATCH (n) RETURN COUNT(n) AS node_count\")"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "3aKjOaKjtSos",
        "outputId": "293e8a1e-153b-4497-f901-92722bc91d81"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "bolt://neo4j:Changabanga30@4.tcp.eu.ngrok.io:17966\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "from neomodel.scripts.neomodel_inspect_database import inspect_database\n",
        "\n",
        "def get_models():\n",
        "    # Call the inspect_database function with the appropriate Neo4j connection URL\n",
        "    script = inspect_database(config.DATABASE_URL)\n",
        "\n",
        "    with open(\"models.py\", \"w\") as f:\n",
        "        f.write(script)\n"
      ],
      "metadata": {
        "id": "wXwv9VscAIgb"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "db._NODE_CLASS_REGISTRY = {}\n",
        "\n",
        "# class RelatedToRel(StructuredRel):\n",
        "#     Relationship = StringProperty()\n",
        "#     z = ArrayProperty(FloatProperty())\n",
        "\n",
        "# class Entity(StructuredNode):\n",
        "#     name = StringProperty(index=True, required=True)\n",
        "#     description = StringProperty()"
      ],
      "metadata": {
        "id": "Hd9XbyPZDSd9"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "## _List functions in module"
      ],
      "metadata": {
        "id": "KDwN-MPqwu_W"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "# list all functions defined in this module only\n",
        "\n",
        "import inspect\n",
        "import sys\n",
        "\n",
        "# Get the current module\n",
        "current_module = sys.modules[__name__]\n",
        "\n",
        "# List all functions and their arguments defined in this module\n",
        "functions_with_args = {func: str(inspect.signature(getattr(current_module, func)))\n",
        "                       for func in dir(current_module) if inspect.isfunction(getattr(current_module, func))}\n",
        "\n",
        "# Display the function names with their arguments\n",
        "for func, args in functions_with_args.items():\n",
        "    print(f\"{func}{args}\")\n",
        "\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "huc80fndwQC_",
        "outputId": "36136c2e-d047-465c-f767-71879d758b7d"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "['generate_summary', 'get_category', 'get_client', 'get_embeddings', 'get_openai']\n"
          ]
        }
      ]
    }
  ],
  "metadata": {
    "colab": {
      "provenance": [],
      "toc_visible": true,
      "mount_file_id": "1dKxodd5jpw7axHLT7b8v9-LXdHD7ckP7",
      "authorship_tag": "ABX9TyPH7kPeo6SF65C0mckPz2/2",
      "include_colab_link": true
    },
    "kernelspec": {
      "display_name": "Python 3",
      "name": "python3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 0
}